import 'package:edzo/core/widgets/scaffold/app_scaffold.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class PolicyPage extends StatelessWidget {
  const PolicyPage({super.key});

  @override
  Widget build(BuildContext context) {
    final defaultStyle = TextStyle(
      color: Theme.of(context).textTheme.bodyMedium?.color,
    
    );

    final boldStyle = defaultStyle.copyWith(fontWeight: FontWeight.bold);

    return AppScaffold(
     
      body: SingleChildScrollView(
        child: RichText(
          text: TextSpan(
            style: defaultStyle,
            children: [
              const TextSpan(text: 'مرحباً بك في تطبيقنا!\n\n'),
              const TextSpan(
                text:
                'باستخدامك لهذا التطبيق، فإنك توافق على الشروط التالية:\n\n',
              ),
              TextSpan(text: '📄 الشروط والأحكام\n\n', style: boldStyle),
              TextSpan(text: 'الشروط الخاصة بالاساتذة\n', style: boldStyle),
              const TextSpan(
                text:
                '\nيلتزم المحاضر باستخدام منصة إيدزو بشكل مهني وعدم الإضرار بسمعتها أو بالمستخدمين.\n'
                    'كل محتوى ينشره المحاضر هو تحت مسؤوليته من حيث الدقة والمصدر والقانونية.\n'
                    'يُمنع نشر أي محتوى مخالف للقوانين أو يحتوي على إساءة أو تمييز أو ينتهك حقوق الغير.\n'
                    'يحتفظ المحاضر بكامل حقوق الملكية الفكرية للدورات التي ينشرها على المنصة.\n'
                    'يُسمح للمحاضر بنشر دوراته خارج المنصة بحرية تامة دون قيود.\n'
                    'تتحمل المنصة مسؤولية الصيانة الفنية بما يضمن جودة الاستخدام ضمن الإمكانيات المتوفرة.\n'
                    'لا تضمن المنصة الحماية الكاملة من تسريب الفيديوهات رغم اتخاذ إجراءات وقائية.\n'
                    'تقع مسؤولية حفظ نسخ احتياطية من الفيديوهات على المحاضر، إذ لا يمكن تحميلها بعد رفعها.\n'
                    'يدفع المحاضر نسبة شهرية من أرباح الدورات، ويجوز تعديل النسبة بعد إشعار مسبق.\n'
                    'المنصة غير مسؤولة عن أي ضرر ناتج عن استخدام الخدمة أو تسريب المحتوى.\n'
                    'تحتفظ المنصة بحق تعديل الشروط في أي وقت، ويُعد استمرار الاستخدام موافقة عليها.\n\n',
              ),
              TextSpan(text: 'الشروط الخاصة بالمستخدمين\n', style: boldStyle),
              const TextSpan(
                text:
                '\nيُمنع استخدام التطبيق لأي غرض غير تعليمي أو يخالف القوانين المعمول بها.\n'
                    'يجب احترام جميع المحاضرين والمستخدمين وعدم الإساءة أو المضايقة.\n'
                    'يُمنع مشاركة الحساب مع الآخرين أو بيع/تبادل بيانات الدخول.\n'
                    'يمنع تصوير الشاشة أو محاولة تسجيل الفيديوهات داخل التطبيق.\n'
                    'الاشتراك في الكورسات يمنح صلاحية المشاهدة فقط، وليس إعادة النشر أو التوزيع.\n'
                    'يُحظر تحميل الفيديوهات أو محاولة كسر الحماية التقنية المضافة عليها.\n'
                    'المنصة غير مسؤولة عن قرارات أو محتوى المحاضرين، بل مسؤوليتهم الخاصة.\n'
                    'يتم حفظ بياناتك بشكل آمن، ولكن يجب عليك الحفاظ على كلمة مرورك وعدم مشاركتها.\n'
                    'لا يحق للمستخدم المطالبة باسترجاع أموال بعد تفعيل الكود أو مشاهدة المحتوى.\n'
                    'نحتفظ بحق إيقاف أو حظر أي حساب يخالف هذه القوانين بدون سابق إنذار.\n'
                    'استمرار استخدامك للتطبيق يعني موافقتك الكاملة على هذه الشروط وأي تحديث يطرأ عليها.\n\n'
                    'شكراً لاستخدامك تطبيقنا ❤',
              ),
            ],
          ),
        ),
      ),
    );
  }
}
